Documents/СписаниеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>СписаниеМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьТоваровПоФакту</xr:Item>
				<xr:Item>AccountingRegister.РегистрБухгалтерии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ПланСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПриобретения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ПланСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/СтоимостьТоваровПоФакту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>СтоимостьТоваровПоФакту</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/СписаниеМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция СписокПокупныхЦен(ЮрЛицо, Дата, Товар, Склад)
	
	ЗапросСписка = Новый Запрос;
	
	ЗапросСписка.Текст = 
	  "ВЫБРАТЬ
	  |	СтоимостьТоваровПоФактуОстатки.Цена КАК Цена
	  |ИЗ
	  |	РегистрНакопления.СтоимостьТоваровПоФакту.Остатки(
	  |			&Дата,
	  |			Номенклатура.Ссылка = &Товар
	  |				И Склад = &Склад И ЮрЛицо = &ЮрЛицо) КАК СтоимостьТоваровПоФактуОстатки";
	
	ЗапросСписка.УстановитьПараметр("Товар", Товар);
	ЗапросСписка.УстановитьПараметр("Дата", Дата);
	ЗапросСписка.УстановитьПараметр("ЮрЛицо", ЮрЛицо);
	ЗапросСписка.УстановитьПараметр("Склад", Склад);
	РезультатЗапросСписка = ЗапросСписка.Выполнить();
	ВыборкаСписка = РезультатЗапросСписка.Выбрать();
	
	СписокЦен = Новый Массив;
	Пока ВыборкаСписка.Следующий() Цикл
		СписокЦен.Добавить(ВыборкаСписка.Цена);
	КонецЦикла;
	
	Возврат СписокЦен;
	
КонецФункции


&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элементы.Материалы.ТекущиеДанные.СчетУчета = ПредопределенноеЗначение("ПланСчетов.ПланСчетов.С10с1");
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриобретенияПриИзменении(Элемент)
	
	СТЧ = Элементы.Материалы.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.ЦенаПриобретения * СТЧ.Количество;
	
КонецПроцедуры


&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	
	СТЧ = Элементы.Материалы.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.ЦенаПриобретения * СТЧ.Количество;
	
КонецПроцедуры


&НаКлиенте
Процедура МатериалыЦенаПриобретенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Товар = Элементы.Материалы.ТекущиеДанные.Номенклатура;
	МассивЦен = СписокПокупныхЦен(Объект.ЮрЛицо, Объект.Дата, Товар, Объект.Склад);
	Элемент.СписокВыбора.ЗагрузитьЗначения(МассивЦен);
	
КонецПроцедуры
